package main

//ООП
func main() {

	//Основные принцыпы: Абстракция инкапсюляция наследование полиморфизм
	// Абстракция – выделение значимой инфрормации , исключение из рассмотрения незначимой, набор характеристик создаваемой нами сущности (структуры)
	// Инкапсуляция – объединяем данные и методы в одну сущность, скрываем и разграничиваем доступы к разным частям программы
	// Наследование – с помощью наследование наш абстрактный тип данных может принимать(наследовать)данные и функциональность другого типа.(интерфейсы)
	// Полиморфизм – возможноть обьектов с олинаковой спецификацией иметь различную реализацию. Один интерфейс  множество реализаций.

}
